Revit 2018 API
OverrideGraphicSettings Properties
The OverrideGraphicSettings type exposes the following members.
Properties
Name | Description
CutFillColor
 Cut surface fill color.
CutFillPatternId
 ElementId of the cut surface fill pattern.
CutLineColor
 Cut surface line color.
CutLinePatternId
 ElementId of the cut surface line pattern.
CutLineWeight
 Cut surface line weight.
DetailLevel
 The Detail Level.
Halftone
 Value of the halftone override.
InvalidPenNumber
 The invalidPenNumber for clearing line wieght overrides.
IsCutFillPatternVisible
 Visibility of the cut surface fill pattern.
IsProjectionFillPatternVisible
 The visibility of the projection surface fill pattern.
IsValidObject
 Specifies whether the .NET object represents a valid Revit entity.
ProjectionFillColor
 Projection surface fill color.
ProjectionFillPatternId
 ElementId of the projection surface fill pattern.
ProjectionLineColor
 Projection surface line color.
ProjectionLinePatternId
 Id of the projection surface line pattern.
ProjectionLineWeight
 The projection surface line weight.
Transparency
 Transparency of surfaces.
See Also
OverrideGraphicSettings Class
Autodesk.Revit.DB Namespace